STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Zigbee/Zigbee_OnOff_Server_Coord_ThreadX/STM32_WPAN/App/app_zigbee.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File Name          : app_zigbee.c
  * Description        : Zigbee Application common code.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include <assert.h>
#include <stdint.h>

#include "app_common.h"
#include "app_conf.h"
#include "main.h"
#include "log_module.h"
#include "app_entry.h"
#include "app_zigbee.h"
#include "app_zigbee_endpoint.h"
#include "dbg_trace.h"
#include "ieee802154_enums.h"
#include "mcp_enums.h"

#include "stm32_rtos.h"
#include "stm32_timer.h"

#include "zigbee.h"
#include "zigbee.nwk.h"
#include "zigbee.security.h"

#include "zcl/zcl.h"

/* Private includes -----------------------------------------------------------*/
/* USER CODE BEGIN PI */
#include "app_bsp.h"

/* USER CODE END PI */

/* Public variables -----------------------------------------------------------*/
ZigbeeAppInfo_t                                     stZigbeeAppInfo;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_BLINK_LED_DELAY                  1000u             // Time (in ms) between two Led Blinck during the Startup/Join (up to 17 s).
#define APP_ZIGBEE_STARTUP_WAIT_DELAY               ( 60u * 1000u )   // Time (in ms) to wait the finish Join (60 seconds).
#define APP_ZIGBEE_STARTUP_FAIL_DELAY               500u              // Time (in ms) between two tentative to Join a Coord/Router.

/* Defines for Basic Cluster Server */
#define APP_ZIGBEE_MFR_NAME                         "STMicroelectronics"
#define APP_ZIGBEE_CHIP_NAME                        "STM32WBA"
#define APP_ZIGBEE_CHIP_VERSION                     0x20        // Cut 2.0
#define APP_ZIGBEE_BOARD_POWER                      0x00        // No Power

#define APP_ZIGBEE_APP_DATE_CODE                    "20260301"
#define APP_ZIGBEE_APP_BUILD_ID                     "V1.9"
#define APP_ZIGBEE_APP_VERSION                      0x19                    // Application Version v1.9
#define APP_ZIGBEE_STACK_VERSION                    ( ( 26u << 2u ) | 1u )  // Stack Version 2026.1

/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private constants ---------------------------------------------------------*/
/* USER CODE BEGIN PC */

/* USER CODE END PC */

/* Private function prototypes -----------------------------------------------*/
static void APP_ZIGBEE_ConfigBasicServer              ( void );
static void APP_ZIGBEE_TraceError                     ( const char * pMess, uint32_t lErrCode );
static void APP_ZIGBEE_ConfigMeshNetwork              ( void );
static void APP_ZIGBEE_ZbCallbackTimeOutTimerCallback ( void * arg );
static void APP_ZIGBEE_ZbRestartJoinTimerCallback     ( void * arg );
static void APP_ZIGBEE_BlinckLedTimerCallback         ( void * arg );
static void APP_ZIGBEE_Printf                         ( struct ZigBeeT * zb, uint32_t lMask, const char * pHeader, const char * pFrame, va_list argptr );

static enum zb_msg_filter_rc APP_ZIGBEE_DeviceJointCallback   ( struct ZigBeeT * zb, uint32_t lId, void * pMessage, void * arg );

static void APP_ZIGBEE_NwkFormOrJoinTask      ( ULONG lArgument );

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private variabless -----------------------------------------------*/
static UTIL_TIMER_Object_t      stZbCallbackTimeOutTimer, stZbRestartJoinTimer, stBlinckLedTimer;

TX_SEMAPHORE                    EndWaitCallbackSemaphore;
TX_SEMAPHORE                    NwkFormStartSemaphore;
TX_SEMAPHORE                    NwkFormRestartWaitEndSemaphore;
TX_THREAD                       NwkFormJoinTask;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Functions Definition ------------------------------------------------------*/

/**
 * @brief  Initialize 'Network Form or Join' Task
 *
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_NwkFormOrJoinTaskInit( void )
{
  UINT        ThreadXStatus;
  CHAR        * pStack = TX_NULL;

  /* First, create the Timer service to indicate end of a Callback */
  UTIL_TIMER_Create( &stZbCallbackTimeOutTimer, 0, UTIL_TIMER_ONESHOT, &APP_ZIGBEE_ZbCallbackTimeOutTimerCallback, NULL );
  UTIL_TIMER_Create( &stZbRestartJoinTimer, 0, UTIL_TIMER_ONESHOT, &APP_ZIGBEE_ZbRestartJoinTimerCallback, NULL );

  if ( stZigbeeAppInfo.eStartupControl == ZbStartTypeJoin )
  {
    /* Create the Timer service to can advertise user during the time of the Join (by default 17 seconds) */
    UTIL_TIMER_Create( &stBlinckLedTimer, APP_ZIGBEE_BLINK_LED_DELAY, UTIL_TIMER_PERIODIC, &APP_ZIGBEE_BlinckLedTimerCallback, NULL );

    /* Launch Blue Led Blink during Join */
    UTIL_TIMER_Start( &stBlinckLedTimer );
  }

  /* Register Semaphore to launch the Network Form Task */
  ThreadXStatus = tx_semaphore_create( &NwkFormStartSemaphore, "NwkFormStartSemaphore", 0 );

  /* Register Semaphore to wait the end of a 'Form or Join' tentative */
  if ( ThreadXStatus == TX_SUCCESS )
  {
    ThreadXStatus |= tx_semaphore_create( &NwkFormRestartWaitEndSemaphore, "NwkFormRestartWaitEndSemaphore", 0 );
  }

  /* Register Semaphore to Wait a time between 2 'Join' tentatives */
  if ( ThreadXStatus == TX_SUCCESS )
  {
    ThreadXStatus |= tx_semaphore_create( &EndWaitCallbackSemaphore, "EndWaitCallbackSemaphore", 0 );
  }

  /* Create the Network Form Thread with this stack */
  if ( ThreadXStatus == TX_SUCCESS )
  {
    ThreadXStatus |= tx_byte_allocate( pBytePool, (void **)&pStack, TASK_STACK_SIZE_ZIGBEE_NETWORK_FORM, TX_NO_WAIT );
  }
  if ( ThreadXStatus == TX_SUCCESS )
  {
    ThreadXStatus |= tx_thread_create(  &NwkFormJoinTask, "NwkFormJoinTask", APP_ZIGBEE_NwkFormOrJoinTask, 0, pStack,
                                        TASK_STACK_SIZE_ZIGBEE_NETWORK_FORM, TASK_PRIO_ZIGBEE_NETWORK_FORM, TASK_PRIO_ZIGBEE_NETWORK_FORM,
                                        TX_NO_TIME_SLICE, TX_AUTO_START );
  }

  /* Verify if it's OK */
  if ( ThreadXStatus != TX_SUCCESS )
  {
    LOG_ERROR_APP( "Network Join ThreadX objects creation FAILED (%d)", ThreadXStatus );
    Error_Handler();
  }

  /* launch the startup of the mesh network setup */
  tx_semaphore_put( &NwkFormStartSemaphore );
}

/**
 * @brief  Configure Zigbee Basic Server Cluster
 *
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ConfigBasicServer( void )
{
  static struct ZbZclBasicServerDefaults   stBasicServerDefaults;

  /* Initialize Basic Server Cluster 'defaults' information */
  memset( &stBasicServerDefaults, 0x00, sizeof(stBasicServerDefaults) );

